Revit 2024 API
BuiltInFailures.DimensionFailures.UnavailableDimensionHostReference Property
 A dimension reference could not be resolved on the host element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UnavailableDimensionHostReference { get; }
Visual Basic
Public Shared ReadOnly Property UnavailableDimensionHostReference As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UnavailableDimensionHostReference {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace